Tester/src/DataProcessors/Load/Load.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Load</name>
  <tabularSections>
    <name>Repositories</name>
    <attributes>
      <name>Use</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Application</name>
      <type>
        <types>CatalogRef.Applications</types>
      </type>
    </attributes>
    <attributes>
      <name>Folder</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Tester/src/Enums/Scenarios/Scenarios.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scenarios</name>
  <enumValues>
    <name>Folder</name>
  </enumValues>
  <enumValues>
    <name>Library</name>
  </enumValues>
  <enumValues>
    <name>Scenario</name>
  </enumValues>
  <enumValues>
    <name>Method</name>
  </enumValues>
</mdclass:Enum>

Tester/src/Catalogs/TagKeys/TagKeys.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>TagKeys</name>
  <tabularSections>
    <name>Tags</name>
    <attributes>
      <name>Tag</name>
      <type>
        <types>CatalogRef.Tags</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Tester/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Users</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>AccessDenied</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Agent</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ApplicationsAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FullName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Language</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TimeZone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Applications</name>
    <attributes>
      <name>Application</name>
      <type>
        <types>CatalogRef.Applications</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Managers</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>RoleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Tester/src/DataProcessors/Load/ManagerModule.bsl
Procedure AssembleTemplate ( Data, Scenario ) export
	
	tabDoc = getSpreadsheet ( Data );
	anchor = Max ( 1, tabDoc.TableHeight - 1 );
	areas = Scenario.Areas;
	signature = tabDoc.Area ( anchor, 1, anchor, 1 ).Text;
	if ( signature = RepositoryFiles.Signature () ) then
		table = areas.UnloadColumns ();
		anchor = anchor + 1;
		set = Conversion.FromJSON ( tabDoc.Area ( anchor, 1, anchor, 1 ).Text );
		for each row in set do
			newRow = table.Add ();
			FillPropertyValues ( newRow, row );
		enddo; 
		areas.Load ( table );
		tabDoc = tabDoc.GetArea ( "R1:R" + Format ( anchor - 2, "NG=" ) );
	else
		areas.Clear ();
	endif;
	Scenario.Template = new ValueStorage ( tabDoc );
	Scenario.Spreadsheet = true;
	
EndProcedure

Function getSpreadsheet ( Data )
	
	storage = ? ( TypeOf ( Data ) = Type ( "BinaryData" ), Data, GetFromTempStorage ( Data ) );
	stream = storage.OpenStreamForRead ();
	tabDoc = new SpreadsheetDocument ();
	tabDoc.Read ( stream );
	stream.Close ();
	return tabDoc;
	
EndFunction 

Procedure ResetTemplate ( Scenario ) export
	
	Scenario.Template = new ValueStorage ( new SpreadsheetDocument () );
	Scenario.Areas.Clear ();
	Scenario.Spreadsheet = false;

EndProcedure

Procedure Properties ( Data, Scenario ) export
	
	params = Conversion.FromJSON ( Data );
	Scenario.Tree = params.Tree;
	Scenario.Creator = getCreator ( params.Creator );
	Scenario.LastCreator = getCreator ( params.LastCreator );
	Scenario.Tag = Catalogs.TagKeys.Pick ( params.Tags );
	Scenario.Type = Enums.Scenarios [ params.Type ];
	Scenario.Severity = ? ( params.Severity = "", undefined, Enums.Severity [ params.Severity ] );
	Scenario.Memo = params.Memo;
	
EndProcedure

Function getCreator ( User )
	
	ref = Catalogs.Users.FindByDescription ( User );
	if ( ref.IsEmpty () ) then
		obj = Catalogs.Users.CreateItem ();
		obj.Description = User;
		obj.AccessDenied = true;
		obj.DataExchange.Load = true;
		obj.Write ();
		ref = obj.Ref;
	endif;
	return ref;
	
EndFunction
